In [2]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Minsu','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}

#Create a DataFrame
df = pd.DataFrame(d)

df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Minsu   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

對以下成績資料做分析

Q1:6 號學生(student_id=6) 3 科平均分數為何？

Q2:6 號學生 3 科平均分數是否有贏過班上一半的同學？

Q3:由於班上同學成績不好，所以學校統一加分，加分方式為開根號乘以十，請問 6 號同學 3 科成績分別是？

Q4:承上題，加分後各科班平均變多少？


score_df = pd.DataFrame([[1,56,66,70], [2,90,45,34], [3,45,32,55], [4,70,77,89], [5,56,80,70], [6,60,54,55], [7,45,70,79], [8,34,77,76], [9,25,87,60], [10,88,40,43]],columns=['student_id','math_score','english_score','chinese_score'])

In [19]:
import pandas as pd

score_df = pd.DataFrame([[1,56,66,70], [2,90,45,34], [3,45,32,55], [4,70,77,89], [5,56,80,70], [6,60,54,55], [7,45,70,79], [8,34,77,76], [9,25,87,60], [10,88,40,43]],columns=['student_id','math_score','english_score','chinese_score'])

In [25]:
new_score_df = score_df.set_index('student_id')
new_score_df

            math_score  english_score  chinese_score
student_id
1                   56             66             70
2                   90             45             34
3                   45             32             55
4                   70             77             89
5                   56             80             70
6                   60             54             55
7                   45             70             79
8                   34             77             76
9                   25             87             60
10                  88             40             43

In [53]:
#Q1

Mean = new_score_df.mean(axis = 1)
Mean.iloc[5]
#56.333333

56.333333333333336

In [37]:
#Q2
Mean.median(axis = 0) #59.83 > 56.333, No

59.833333333333336

In [47]:
#Q3

Curved = new_score_df.apply(lambda x : (x ** 0.5) * 10)
Curved.query('student_id == 6')
#77.45, 73.48, 74.16

            math_score  english_score  chinese_score
student_id
6            77.459667      73.484692      74.161985

In [56]:
#Q4

Curved.mean(axis = 0)

math_score       74.194221
english_score    78.350301
chinese_score    78.739928
dtype: float64